#lang racket

#|
  Упражнение 3.38

  Пусть Петр, Павел и Мария имеют общий счет, на котором вначале лежит 100 долларов. Петр кладет на счет
  10 долларов, одновременно с этим Павел берет 20, а Мария берет половину денег со счета. При этом они
  выполняют следующие операции:

    Peter: (set! balance (+ balance 10))
    Paul: (set! balance (- balance 20))
    Mary: (set! balance (- balance (/ balance 2)))

  а. Перечислите возможные значения balance после завершения операций, предполагая, что банковская система
  требует от транзакций исполняться последовательно в каком-то порядке.

  б. Назовите какие-нибудь другие значения, которые могли бы получиться, если бы система разрешала операциям
  чередоваться. Нарисуйте временные диаграммы, подобные рис. 3.29, чтобы объяснить, как возникают такие
  результаты.
|#

#|
  a. Перечислим возможные значения balance после завершения операций, предполагая, что они могут выполняться
  исключительно последовательно:

    1) P (Peter) -> Pl (Paul) -> M (Mary): 110 -> 90 -> 45
    2) P -> M -> Pl: 110 -> 55 -> 35
    3) Pl -> P -> M: 80 -> 90 -> 45
    4) Pl -> M -> P: 80 -> 40 -> 50
    5) M -> P -> Pl: 50 -> 60 -> 40
    6) M -> Pl -> P: 50 -> 30 -> 40

  Таким образом, баланс может равняться 35, 40, 45 и 50.

  b. Проблемы могут возникать на этапе присваивания. Для того, чтобы это продемонстрировать, придётся
  расписать операции пользователей более дробно:

    Peter:
    P!  (set! balance
    P+    (+ balance 10))
    Paul:
    Pl! (set! balance
    Pl-   (- balance 20))
    Mary: 
    M! (set! balance
    M-   (- balance
    M/      (/ balance 2)))

  Некоторые возможные значения баланса, если допустить вмешательство процедур в работу друг друга:

    1) actions: P+  -> Pl- -> Pl! -> M/ -> M- -> M! -> P!
       balance: 100 -> 100 -> 80  -> 80 -> 80 -> 40 -> 110
    2) actions: P+  -> Pl- -> Pl! -> M/ -> P!  -> M-  -> M!
       balance: 100 -> 100 -> 80  -> 80 -> 110 -> 110 -> 70

  Схема, которая иллюстрирует случай 1:

      │         Bank                 Peter                  Paul                   Mary
      │   ┏━━━━━━━━━━━━━━━┓ ┏━━━━━━━━━━━━━━━━━━━━┓
      │   ┃ balance: 100  ┃ ┃ read balance: 100  ┃
      │   ┗━━━━━━━┯━━━━━━━┛ ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │           ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │           ┃ read balance: 100  ┃
      │           │                    ▼           ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │         ┏━━━━━━━━━━━━━━━━━━━━┓            │
      │           │         ┃ + balance 10: 110  ┃            │
      │           │         ┗━━━━━━━━━━┯━━━━━━━━━┛            ▼
      │           │                    │           ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │           ┃ - balance 20: 80   ┃
      │           │                    │           ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                      ▼
      │           │                    │           ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │ ┌──────────────────│───────────┨ set! balance: 80   ┃
      │           ▼ ▼                  │           ┗━━━━━━━━━━━━━━━━━━━━┛
      │   ┏━━━━━━━━━━━━━━━┓            │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │   ┃ balance: 80   ┃            │                                  ┃ read balance: 80   ┃
      │   ┗━━━━━━━┯━━━━━━━┛            │                                  ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                                             ▼
      │           │                    │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │                                  ┃ / balance 2: 40    ┃
      │           │                    │                                  ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                                             ▼
      │           │                    │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │                                  ┃ read balance: 80   ┃
      │           │                    │                                  ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                                             ▼
      │           │                    │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │                                  ┃ - balance 40: 40   ┃
      │           │                    │                                  ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                                             ▼
      │           │                    │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │ ┌──────────────────│──────────────────────────────────┨ set! balance: 40   ┃
      │           ▼ ▼                  ▼                                  ┗━━━━━━━━━━━━━━━━━━━━┛
      │   ┏━━━━━━━━━━━━━━━┓ ┏━━━━━━━━━━━━━━━━━━━━┓
      │   ┃ balance: 40   ┃ ┃ set! balance: 110  ┃
      │   ┗━━━━━━━┯━━━━━━━┛ ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           ▼                    │
      │   ┏━━━━━━━━━━━━━━━┓            │
      │   ┃ balance: 110  ┃◄───────────┘
      │   ┗━━━━━━━━━━━━━━━┛
      ▼
    time

  Схема, которая иллюстрирует случай 2:

      │         Bank                 Peter                  Paul                   Mary
      │   ┏━━━━━━━━━━━━━━━┓ ┏━━━━━━━━━━━━━━━━━━━━┓
      │   ┃ balance: 100  ┃ ┃ read balance: 100  ┃
      │   ┗━━━━━━━┯━━━━━━━┛ ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │           ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │           ┃ read balance: 100  ┃
      │           │                    ▼           ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │         ┏━━━━━━━━━━━━━━━━━━━━┓            │
      │           │         ┃ + balance 10: 110  ┃            │
      │           │         ┗━━━━━━━━━━┯━━━━━━━━━┛            ▼
      │           │                    │           ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │           ┃ - balance 20: 80   ┃
      │           │                    │           ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                      ▼
      │           │                    │           ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │ ┌──────────────────│───────────┨ set! balance: 80   ┃
      │           ▼ ▼                  │           ┗━━━━━━━━━━━━━━━━━━━━┛
      │   ┏━━━━━━━━━━━━━━━┓            │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │   ┃ balance: 80   ┃            │                                  ┃ read balance: 80   ┃
      │   ┗━━━━━━━┯━━━━━━━┛            │                                  ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    │                                             ▼
      │           │                    │                                  ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                    │                                  ┃ / balance 2: 40    ┃
      │           │                    │                                  ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                    ▼                                             │
      │           │         ┏━━━━━━━━━━━━━━━━━━━━┓                                   │
      │           │   ┌─────┨ set! balance: 110  ┃                                   │
      │           ▼   ▼     ┗━━━━━━━━━━━━━━━━━━━━┛                                   ▼
      │   ┏━━━━━━━━━━━━━━━┓                                               ┏━━━━━━━━━━━━━━━━━━━━┓
      │   ┃ balance: 110  ┃                                               ┃ read balance: 110  ┃
      │   ┗━━━━━━━┯━━━━━━━┛                                               ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                                                                  ▼
      │           │                                                       ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │                                                       ┃ - balance 40: 70   ┃
      │           │                                                       ┗━━━━━━━━━━┯━━━━━━━━━┛
      │           │                                                                  ▼
      │           │                                                       ┏━━━━━━━━━━━━━━━━━━━━┓
      │           │ ┌─────────────────────────────────────────────────────┨ set! balance: 70   ┃
      │           ▼ ▼                                                     ┗━━━━━━━━━━━━━━━━━━━━┛
      │   ┏━━━━━━━━━━━━━━━┓
      │   ┃ balance: 70   ┃
      │   ┗━━━━━━━━━━━━━━━┛
      ▼
    time
|#
